Тест_ЗУП_31_КОРП/src/Documents/ИзучениеЭлектронногоКурса/ИзучениеЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзучениеЭлектронногоКурса</name>
  <registerRecords>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ЭлектронныеТестыНаПроверку</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаТестовыеВопросы</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлектронныеКурсы</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</registerRecords>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>DefinedType.КонтекстЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>DefinedType.УчащийсяЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИзучения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматИсходныхДанных</name>
    <type>
      <types>EnumRef.ФорматыДанныхЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоТестовоеИзучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПопыткиИзучения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПопытки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/CommonModules/ИзучениеЭлектронныхКурсов/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает данные об изученном электронном курсе.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Структура - см. ИзучениеЭлектронныхКурсовСлужебный.ДанныеОбИзученииЭлектронногоКурса.
//
Функция ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса) Экспорт
	Возврат Документы.ИзучениеЭлектронногоКурса.ДанныеОбИзучении(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает прогресс изучения.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Число - прогресс от 0 до 100.
//
Функция ПрогрессИзучения(ИзучениеЭлектронногоКурса) Экспорт	
	Возврат Документы.ИзучениеЭлектронногоКурса.ПрогрессИзучения(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает результат изучения в стобалльной шкале.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Число - Результат от 0 до 100.
//
Функция РезультатИзучения(ИзучениеЭлектронногоКурса) Экспорт	
	Возврат Документы.ИзучениеЭлектронногоКурса.РезультатИзучения(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает документ изучения электронного курса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - Контекст изучения.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - Учащийся изучения.
//
// Возвращаемое значение:
//  ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
Функция НайтиИзучениеПоКонтексту(ЭлектронныйКурс, Контекст, Учащийся) Экспорт
	Возврат Документы.ИзучениеЭлектронногоКурса.НайтиПоКонтексту(ЭлектронныйКурс, Контекст, Учащийся);
КонецФункции

#КонецОбласти
